api/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "nyokabi"], ["email", "nk@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-23 14:43:59.704881"], ["updated_at", "2023-03-23 14:43:59.704881"]]
---
    def register
        user = User.create(user_params)

SELECT "users".* FROM "users" WHERE (username = NULL OR email = 'nk@gmail.com') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def login
        sql = "username = :username OR email = :email"
        user = User.where(sql, { username: user_params[:username], email: user_params[:email] }).first